import type { ISalesAgents } from "~/modules/profile/types/salesAgentsBalance.type";

export const salesAgentsData: Record<string, ISalesAgents> = {
	"Химки": {
		id: 3,
		districts: {
			"Старые Химки": {
				id: 1,
			},
			"Новые Химки": {
				id: 2,
			},
			"Левобережный": {
				id: 3,
			},
			"Подрезково": {
				id: 4,
			},
			"Сходня": {
				id: 5,
			},
		},
		agents: {
			"К. Леонид": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
			"И. Дружин": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
			"Д. Никольский": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
		},
	},
	"Подольск": {
		id: 1,
		districts: {
			"Старые Подольск": {
				id: 6,
			},
			"Новые Подольск": {
				id: 7,
			},
			"Левобережный": {
				id: 8,
			},
			"Подрезково": {
				id: 9,
			},
			"Сходня": {
				id: 10,
			},
		},
		agents: {
			"К. Леонид": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
			"И. Дружин": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
			"Д. Никольский": {
				balance: {
					"Протеины": 8500,
					"Глютамин": 6200,
					"Креатин": 2050,
					"Л-карнитин": 4200,
				},
				districtsBalance: {
					"Старые Химки": {
						id: 1,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Новые Химки": {
						id: 2,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Левобережный": {
						id: 3,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Подрезково": {
						id: 4,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
					"Сходня": {
						id: 5,
						balance: {
							"Протеины": 8500,
							"Глютамин": 6200,
							"Креатин": 2050,
							"Л-карнитин": 4200,
						},
					},
				},
			},
		},
	},
};
